const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
    // write your solution here
    //получаем из исходной строки expr массив строк где каждая строка состоит из 10 символов
   //т.е split(/(.{10})/).filter(O=>O) - нарезаем строки из expr длиной по 10 символов, и где текущее регулярное выражение
   //создает пустые элементы массива между кусками. filter(x=>x) используется для фильтрации этих пустых элементов
    let exprArr = expr.split(/(.{10})/).filter(O=>O);

    
}

module.exports = {
    decode
}